Revit 2026 API

# CorrectionFactorSetReverseIterator Method

---

Retrieve a backward moving iterator to the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual CorrectionFactorSetIterator ReverseIterator()
```
```vb
Public Overridable Function ReverseIterator As CorrectionFactorSetIterator
```
```cpp
public:
virtual CorrectionFactorSetIterator^ ReverseIterator()
```
```fsharp
abstract ReverseIterator : unit -> CorrectionFactorSetIterator
override ReverseIterator : unit -> CorrectionFactorSetIterator
```

#### Return Value

CorrectionFactorSetIteratorReturns a backward moving iterator to the set.

#### Reference

CorrectionFactorSet Class

Autodesk.Revit.DB.Electrical Namespace